#include <iostream>
/*Вывести на экран числа 50 и 10 одно под другим.*/
int main()
{
    {
        std::cout << 50 << std::endl;
        std::cout << 10 << std::endl;
    }
    return 0;
}